/**
 *  正则的收集
 *
 */
const regRules = {
  // 英文，数字加特殊字符
  leggerDigitSymbol: /^([-!$%^&*()_+|~=`{}\[\]:";'?,.\/]|[！@#￥%……&*（）\—\—+\-={}|：”《》？【】、；’，。、]|\d|[a-zA-Z])+$/,
  // 验证任意多个字符，目的在非必填中，用户删除输入
  leggerDigitSymbol0: /^([-!$%^&*()_+|~=`{}\[\]:";'?,.\/]|[！@#￥%……&*（）\—\—+\-={}|：”《》？【】、；’，。、]|\d|[a-zA-Z])*$/,
  leggerDigitSymbol20: /^([-!$%^&*()_+|~=`{}\[\]:";'?,.\/]|[！@#￥%……&*（）\—\—+\-={}|：”《》？【】、；’，。、]|\d|[a-zA-Z]){0,20}$/,
  nonSpace: /^\S+$/,

  // 数字
  digit: /^\d+$/,

  // 匹配<和>
  noBracket: /^[^<>]+$/,
  noBracketWithEmpty: /^((?![<>]).)*$/,

  // 英文和数字
  numOrLetter: /^[0-9a-zA-Z]+$/,
  numOrLetterWithEmpty: /^[0-9a-zA-Z-]*$/,
  numOrLetter40: /^[0-9a-zA-Z]{2,40}$/,
  numOrLetterCross40: /^[0-9a-zA-Z-]{2,40}$/,

  // >=0的数值（可以包含小数点）
  biggerThanOrEqualZero: /(^([1-9][0-9]*)(\.[0-9]*[1-9])$)|(^0\.[0-9]*[1-9]$)|0|(^[1-9][0-9]*$)/,

  // >0的数值（可以包含小数点）
  biggerThanZero: /(^([1-9][0-9]*)(\.[0-9]*[1-9])$)|(^0\.[0-9]*[1-9]$)|(^[1-9][0-9]*$)/,

  // 合理范围内的数值(前8后2)
  numberReasonably: /(^(0|[1-9][0-9]{0,7})(\.[0-9]{1,2})?$)/,
  numberReasonablyWithEmpty: /(^(0|[1-9][0-9]{0,7})(\.[0-9]{1,2})?$)|^$/,

  // 合理范围内的数值(前8后4)
  numberReasonablyBack4: /(^(0|[1-9][0-9]{0,7})(\.[0-9]{1,4})?$)/,

  // 合理范围内的数值2(前3后2)
  fiveDigits: /(^(0|[1-9][0-9]{0,2})(\.[0-9]?[1-9])?$)/,

  // 合理范围内的数值3(前3后3)
  front3Back3: /(^(0|[1-9][0-9]{0,2})(\.[0-9]?[0-9]?[1-9])?$)/,

  // 前边和后边都没有空格
  noLeadingOrEndingSpace: /(^\S+$|^\S+\s+\S+$)/,

  // 大于等于0的正整数(最多8位)
  positiveInteger: /^([1-9][0-9]{0,7}|0)$/,

  // <=100的正整数
  lessThan100: /^([0-9]|[1-9][0-9]|100)$/,

  // <10000的正整数
  lessThan10000: /^([1-9][0-9]{0,3})$/,

  // 必填
  required: /.+/,

  // 中文，英文，数字，特殊字符
  leggerDigitSymbol1: /^([-!@#$%^&*()_+|~=`{}\[\]:";'?,.\/]|[！@#￥%……&*（）\—\—+\-={}|：”《》？【】、；’，。、]|\d|[a-zA-Z\u4e00-\u9fa5])*$/,

  // 判断以SKU打头
  beforeSkuMessage: /^(SKU)+/,

  // 验证表情
  Emoj: /[\uD83C|\uD83D|\uD83E][\uDC00-\uDFFF][\u200D|\uFE0F]|[\uD83C|\uD83D|\uD83E][\uDC00-\uDFFF]|[0-9|*|#]\uFE0F\u20E3|[0-9|#]\u20E3|[\u203C-\u3299]\uFE0F\u200D|[\u203C-\u3299]\uFE0F|[\u2122-\u2B55]|\u303D|[\A9|\AE]\u3030|\uA9|\uAE|\u3030/gi,
};

export default regRules;
